app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cat in the Hat "], ["created_at", "2023-09-05 17:02:04.098616"], ["updated_at", "2023-09-05 17:02:04.098616"], ["author", "Dr. Suess"], ["price", "10.0"]]